<?php
$name = "张三";
$age = "18";
$sex = "男";
echo "<h4>这是双引号变量解析的功能，单引号就不可以，具体变现如下：</h4>";
echo "大家好我叫{$name},今年{$age}了，我是{$sex}生";
echo "<br />";
echo '大家好我叫{$name},今年{$age}了，我是{$sex}生';
echo "<br />"
?>

<?php
// $arr = array(1,2,3,4);
// print_r($arr);
// $array = array('name'=>'张三','age'=>20);
// print_r($array);

//while循环 在不确定多少次的时候可以用while循环
$i = 0;
while($i<10) {
    // echo "{$i}传智播客";
    $i++;//如果把$i++放在前面会从1打印到10，因为是++完了再打印
    echo "{$i}传智播客<br />\n";
    // $i++; 如果把$i++ 放在后面从0打印到9，因为是打印完了再++
}
echo "====================<br />"
?>

<?php 
//do while 循环 do while 不管条件成不成立都会先执行一次，再判断
$i = 0;
do{
    $i++;//如果把$i++放在前面会从1打印到10，因为是++完了再打印
    echo "$i 黑马程序猿<br />\n";
    // $i++; 如果把$i++ 放在后面从0打印到9，因为是打印完了再++
}while($i<10);
echo "===========================<br />"
?>

<?php 
//for循环
for($i = 0; $i <10; $i++) {
    echo "$i 我爱北京天安门<br />\n";
}
?>